<template>
  <h4>MAIN</h4>
  <div
      @blur="onEditorBlur">
    <div>
      <button
          v-for="btn in durationData"
          @click="onSelectDuration(btn.code)"
      >
        {{ btn.name }}
      </button>
    </div>
    <svg
        :width="width"
        height="100"
        :viewBox="`0 0 ${width} 100`"
        style="scale: 1.1;outline: none;"
        @click.right.prevent
    >
      <!--  Нотоносец  -->
      <g>
        <path stroke-width="1" fill="none" stroke="#999999" stroke-dasharray="none" :d="`M0 30L${width} 30`"></path>
        <path stroke-width="1" fill="none" stroke="#999999" stroke-dasharray="none" :d="`M0 40L${width} 40`"></path>
        <path stroke-width="1" fill="none" stroke="#999999" stroke-dasharray="none" :d="`M0 50L${width} 50`"></path>
        <path stroke-width="1" fill="none" stroke="#999999" stroke-dasharray="none" :d="`M0 60L${width} 60`"></path>
        <path stroke-width="1" fill="none" stroke="#999999" stroke-dasharray="none" :d="`M0 70L${width} 70`"></path>
      </g>

      <!--  Скрипичный ключ   -->
      <svg width="50" height="128" viewBox="10 25 50 128">
        <path stroke-width="0.3" stroke-dasharray="none" fill="black" stroke="none"
              d="M28.711104 65.844288C28.660416 65.41344,28.711104 65.388096,28.9392 65.16C32.892864 61.485119999999995,35.883456 56.847167999999996,35.883456 51.246144C35.883456 48.078143999999995,34.996415999999996 44.935488,33.50112 42.755903999999994C32.943552 41.944896,32.005824000000004 40.931135999999995,31.60032 40.931135999999995C31.09344 40.931135999999995,29.95296 41.868863999999995,29.243328 42.679871999999996C26.53152 45.670463999999996,25.64448 50.232383999999996,25.64448 54.033984C25.64448 56.137536,25.923264000000003 58.519872,26.176704 60.015168C26.252736 60.446016,26.278080000000003 60.522048,25.847231999999998 60.902208C20.57568 65.236032,15 70.456896,15 77.832C15 84.168,19.333824 90.199872,28.280256 90.199872C29.116608 90.199872,30.079680000000003 90.12384,30.814656 89.971776C31.194816000000003 89.89574400000001,31.270848 89.8704,31.346880000000002 90.301248C31.777728 92.759616,32.335296 95.927616,32.335296 97.651008C32.335296 103.04928000000001,28.685760000000002 103.708224,26.53152 103.708224C24.554688 103.708224,23.61696 103.12531200000001,23.61696 102.643776C23.61696 102.390336,23.946432 102.28896,24.782784 102.010176C25.923264000000003 101.680704,27.215808000000003 100.71763200000001,27.215808000000003 98.588736C27.215808000000003 96.58656,25.948608 94.863168,23.718336 94.863168C21.285312 94.863168,19.81536 96.814656,19.81536 99.070272C19.81536 101.42726400000001,21.234624 105.026112,26.759616 105.026112C29.19264 105.026112,33.931968 103.910976,33.931968 97.72704C33.931968 95.62348800000001,33.27302400000001 92.176704,32.892864 89.89574400000001C32.816832000000005 89.464896,32.842176 89.515584,33.349056000000004 89.287488C37.04928 87.817536,39.482304 84.725568,39.482304 80.594496C39.482304 75.9312,36.060864 71.800128,30.687936 71.800128C29.750208 71.800128,29.750208 71.800128,29.623488000000002 71.141184M32.157888 46.582848C33.349056000000004 46.582848,34.337472000000005 47.571264,34.337472000000005 49.57344C34.337472000000005 53.628479999999996,30.865344 56.923199999999994,28.001472 59.432255999999995C27.748032000000002 59.660352,27.595968 59.609663999999995,27.519936 59.128128C27.367872 58.1904,27.29184 56.948544,27.29184 55.78272C27.29184 50.08032,29.927616 46.582848,32.157888 46.582848M28.17888 71.445312C28.280256 72.1296,28.280256 72.10425599999999,27.621312000000003 72.307008C24.427968 73.3968,22.324416 76.286016,22.324416 79.403328C22.324416 82.672704,24.047808 85.004352,26.53152 85.866048C26.835648 85.967424,27.266496 86.0688,27.519936 86.0688C27.798720000000003 86.0688,27.950784 85.891392,27.950784 85.663296C27.950784 85.409856,27.672 85.30848,27.41856 85.207104C25.872576000000002 84.54816,24.782784 82.976832,24.782784 81.304128C24.782784 79.200576,26.202048 77.654592,28.43232 77.020992C29.015232 76.868928,29.091264000000002 76.919616,29.167296 77.32512L30.992064 88.19769600000001C31.068096 88.6032,31.017408 88.6032,30.485184000000004 88.704576C29.902272000000004 88.805952,29.167296 88.881984,28.43232 88.881984C22.045632 88.881984,17.91456 85.33382399999999,17.91456 80.265024C17.91456 78.110784,18.29472 75.221568,21.310656 71.800128C23.515584 69.367104,25.188288 67.998528,26.886336 66.629952C27.266496 66.325824,27.342528 66.37651199999999,27.41856 66.756672M30.687936 77.249088C30.611904000000003 76.792896,30.662592000000004 76.69152,31.09344 76.742208C34.058688000000004 76.995648,36.49171200000001 79.47936,36.49171200000001 82.672704C36.49171200000001 84.979008,35.097792 86.82912,33.070272 87.868224C32.639424000000005 88.070976,32.563392 88.070976,32.48736 87.640128"></path>
      </svg>

      <!--  Размер  -->
      <g>
        <svg width="140" height="200" viewBox="60 20 140 200">
          <path stroke-width="0.3" fill="black" stroke="none" stroke-dasharray="none"
                d="M99.4224 90M104.4336 71.6544C104.4624 71.6256,104.8656 71.6256,106.104 71.6256C106.4784 71.6256,106.88159999999999 71.6256,107.39999999999999 71.6256L110.30879999999999 71.6256L110.39519999999999 71.712C110.5392 71.7984,110.62559999999999 71.94239999999999,110.62559999999999 72.05760000000001C110.62559999999999 72.2304,110.5392 72.3456,110.42399999999999 72.4608C110.39519999999999 72.5472,110.136 72.7776,109.9632 73.0368L108.43679999999999 74.7936L106.4784 77.0112L105.4416 78.19200000000001L103.8864 79.9776L101.8416 82.3104C101.496 82.7424,101.1216 83.088,101.1216 83.088C101.1216 83.088,101.1216 83.088,101.1216 83.088C101.1216 83.1456,101.3808 83.1456,103.7712 83.1456L106.392 83.1456L106.392 81.2736C106.392 79.3728,106.392 79.344,106.4208 79.3152C106.4784 79.2288,106.7376 78.912,107.7456 77.7312L108.1488 77.2992L108.55199999999999 76.8672L109.15679999999999 76.0896L109.79039999999999 75.4272L110.10719999999999 75.024C110.2224 74.8512,110.39519999999999 74.8224,110.5392 74.8224C110.71199999999999 74.8224,110.856 74.9088,110.94239999999999 75.0528C110.9712 75.1392,110.9712 75.1968,110.9712 77.328C110.9712 77.8176,110.9712 78.4224,110.9712 79.1424L110.9712 83.1456L111.6912 83.1456C112.3536 83.1456,112.38239999999999 83.1456,112.4688 83.1744C112.69919999999999 83.2608,112.81439999999999 83.4912,112.81439999999999 83.7504C112.81439999999999 83.8944,112.78559999999999 84.0672,112.6704 84.1824C112.49759999999999 84.3264,112.4688 84.3264,111.6912 84.3264L110.9712 84.3264L110.9712 84.816C111 86.2848,111.288 86.8608,112.4112 87.4656C112.81439999999999 87.6672,112.90079999999999 87.7248,112.90079999999999 88.0128C112.90079999999999 88.2144,112.8432 88.3008,112.69919999999999 88.416L112.6128 88.4448L108.6672 88.4448L104.7504 88.4448L104.664 88.416C104.49119999999999 88.3008,104.4624 88.2144,104.4624 88.0128C104.4624 87.7248,104.49119999999999 87.6672,104.9232 87.4656C106.04639999999999 86.8608,106.3344 86.2848,106.3344 84.816L106.3344 84.3264L103.02239999999999 84.3264C102.4176 84.384,101.928 84.384,101.5248 84.384C99.71039999999999 84.384,99.6816 84.3264,99.6528 84.3264C99.47999999999999 84.2688,99.4224 84.096,99.4224 83.8944C99.4224 83.8944,99.4224 83.8944,99.4224 83.8944C99.4224 83.6928,99.4224 83.6928,99.99839999999999 83.0304C102.4176 80.0928,104.1168 75.8304,104.1168 72.432C104.1168 71.9136,104.2032 71.74080000000001,104.4336 71.6544M106.16159999999999 90.0288L106.1904 90.0288L106.104 90.0288L106.16159999999999 90.0288M106.16159999999999 70.6176L106.1904 70.6176L106.104 70.6176L106.16159999999999 70.6176"></path>
        </svg>

        <svg width="140" height="200" viewBox="60 40 140 200">
          <path stroke-width="0.3" fill="black" stroke="none" stroke-dasharray="none"
                d="M99.4224 90M104.4336 71.6544C104.4624 71.6256,104.8656 71.6256,106.104 71.6256C106.4784 71.6256,106.88159999999999 71.6256,107.39999999999999 71.6256L110.30879999999999 71.6256L110.39519999999999 71.712C110.5392 71.7984,110.62559999999999 71.94239999999999,110.62559999999999 72.05760000000001C110.62559999999999 72.2304,110.5392 72.3456,110.42399999999999 72.4608C110.39519999999999 72.5472,110.136 72.7776,109.9632 73.0368L108.43679999999999 74.7936L106.4784 77.0112L105.4416 78.19200000000001L103.8864 79.9776L101.8416 82.3104C101.496 82.7424,101.1216 83.088,101.1216 83.088C101.1216 83.088,101.1216 83.088,101.1216 83.088C101.1216 83.1456,101.3808 83.1456,103.7712 83.1456L106.392 83.1456L106.392 81.2736C106.392 79.3728,106.392 79.344,106.4208 79.3152C106.4784 79.2288,106.7376 78.912,107.7456 77.7312L108.1488 77.2992L108.55199999999999 76.8672L109.15679999999999 76.0896L109.79039999999999 75.4272L110.10719999999999 75.024C110.2224 74.8512,110.39519999999999 74.8224,110.5392 74.8224C110.71199999999999 74.8224,110.856 74.9088,110.94239999999999 75.0528C110.9712 75.1392,110.9712 75.1968,110.9712 77.328C110.9712 77.8176,110.9712 78.4224,110.9712 79.1424L110.9712 83.1456L111.6912 83.1456C112.3536 83.1456,112.38239999999999 83.1456,112.4688 83.1744C112.69919999999999 83.2608,112.81439999999999 83.4912,112.81439999999999 83.7504C112.81439999999999 83.8944,112.78559999999999 84.0672,112.6704 84.1824C112.49759999999999 84.3264,112.4688 84.3264,111.6912 84.3264L110.9712 84.3264L110.9712 84.816C111 86.2848,111.288 86.8608,112.4112 87.4656C112.81439999999999 87.6672,112.90079999999999 87.7248,112.90079999999999 88.0128C112.90079999999999 88.2144,112.8432 88.3008,112.69919999999999 88.416L112.6128 88.4448L108.6672 88.4448L104.7504 88.4448L104.664 88.416C104.49119999999999 88.3008,104.4624 88.2144,104.4624 88.0128C104.4624 87.7248,104.49119999999999 87.6672,104.9232 87.4656C106.04639999999999 86.8608,106.3344 86.2848,106.3344 84.816L106.3344 84.3264L103.02239999999999 84.3264C102.4176 84.384,101.928 84.384,101.5248 84.384C99.71039999999999 84.384,99.6816 84.3264,99.6528 84.3264C99.47999999999999 84.2688,99.4224 84.096,99.4224 83.8944C99.4224 83.8944,99.4224 83.8944,99.4224 83.8944C99.4224 83.6928,99.4224 83.6928,99.99839999999999 83.0304C102.4176 80.0928,104.1168 75.8304,104.1168 72.432C104.1168 71.9136,104.2032 71.74080000000001,104.4336 71.6544M106.16159999999999 90.0288L106.1904 90.0288L106.104 90.0288L106.16159999999999 90.0288M106.16159999999999 70.6176L106.1904 70.6176L106.104 70.6176L106.16159999999999 70.6176"></path>
        </svg>
      </g>

      <!--  Нота   -->
      <template v-for="(takt, taktIndex) in devidedByTaksts">

        <app-note
            v-for="(note, index) in takt"
            :key="index"
            :duration="note.duration"
            :is-selected="selectedNoteId === note.id"
            :order="index"
            :pitch="note.pitch"
            @click="onClick(note)"
            @click.right="deleteNote(note.id)"
        />

        <g>
          <rect x="120" width="100" height="100"></rect>
          <line
              stroke="red"
              :x1="taktWidth[taktIndex].x + taktWidth[taktIndex].width - 1"
              y1="30"
              :x2="taktWidth[taktIndex].x + taktWidth[taktIndex].width - 1"
              y2="70"
          />
          <rect x="120" width="100" height="100"></rect>
        </g>
      </template>

<!--      <svg-->
<!--          v-for="(takt, taktIndex) in devidedByTaksts"-->
<!--          :key="taktIndex"-->
<!--          :x="taktWidth[taktIndex].x"-->
<!--          :viewBox="`-${taktWidth[taktIndex].x} 0 ${taktWidth[taktIndex].width} 100`"-->
<!--      >-->
<!--        &lt;!&ndash;  Нота   &ndash;&gt;-->
<!--        <app-note-->
<!--            v-for="(note, index) in takt"-->
<!--            :key="index"-->
<!--            :duration="note.duration"-->
<!--            :is-selected="selectedNoteId === note.id"-->
<!--            :order="index"-->
<!--            :pitch="note.pitch"-->
<!--            @click="onClick(note)"-->
<!--            @click.right="deleteNote(note.id)"-->
<!--        />-->

<!--        &lt;!&ndash;  Тактовая черта   &ndash;&gt;-->
<!--&lt;!&ndash;        <line&ndash;&gt;-->
<!--&lt;!&ndash;            stroke="red"&ndash;&gt;-->
<!--&lt;!&ndash;            :x1="taktWidth[taktIndex].x + taktWidth[taktIndex].width - 1"&ndash;&gt;-->
<!--&lt;!&ndash;            y1="30"&ndash;&gt;-->
<!--&lt;!&ndash;            :x2="taktWidth[taktIndex].x + taktWidth[taktIndex].width - 1"&ndash;&gt;-->
<!--&lt;!&ndash;            y2="70"&ndash;&gt;-->
<!--&lt;!&ndash;        />&ndash;&gt;-->

<!--        <rect-->
<!--          x="0"-->
<!--          y="0"-->
<!--          :width="taktWidth[taktIndex].x + taktWidth[taktIndex].width - 1"-->
<!--          height="70"-->
<!--        />-->
<!--      </svg>-->
    </svg>
  </div>
</template>

<script>
import AppNote from "../components/editor/AppNote.vue";
import {mapState} from "vuex";

export default {
  name: 'MainPage',
  components: {AppNote},
  // props: {
  //   width: {
  //     type: String,
  //     default: '900'
  //   }
  // },
  computed: {
    ...mapState({
      notePitches: state => state.NOTE_PITCHES,
      melody: state => state.melody,
      durationData: state => state.DURATIONS,
    }),
    taktWidth() {
      const res = []
      this.devidedByTaksts.reduce((accumX, b) => {
        res.push({
          x: accumX,
          width: (b.length * 30),
        })

        accumX += (b.length * 30)
        return accumX
      }, 0)

      return res
    },
    devidedByTaksts() {
      const takts = []
      let readyTact = []
      const getDurationValue = (code) => {
        return this.durationData.find(dur => {
          return dur.code === code
        }).value
      }
      let value = 0
      this.innerMelody.forEach(note => {
        value += getDurationValue(note.duration)
        readyTact.push(note)

        if (value === 1) {
          takts.push(readyTact)
          readyTact = []
          value = 0
        } else if (value > 1) {
          // TODO
          takts.push(readyTact)
          console.log(takts)
          readyTact = []
          value = 0
          console.log('Ошибка!!!')
        }
      })

      return takts
    },
  },
  data() {
    return {
      width: '900',
      selectedNoteId: '',
      innerMelody: [],
    }
  },
  watch: {
    melody: {
      immediate: true,
      deep: true,
      handler(newVal) {
        this.innerMelody = newVal
      },
    }
  },
  beforeMount() {
    window.addEventListener('keydown', this.handleKeydown)
  },
  beforeDestroy() {
    window.removeEventListener('keydown', this.handleKeydown);
  },
  methods: {
    deleteNote(noteID) {
      this.innerMelody = this.melody.filter(note => note.id !== noteID)
    },
    onSelectDuration(code) {
      if (this.selectedNoteId) {
        const editingNote = this.innerMelody.find(note => note.id === this.selectedNoteId)
        editingNote.duration = code
      }
    },

    handleKeydown($event) {
      if (['ArrowUp', 'ArrowDown', 'ArrowLeft', 'ArrowRight'].includes($event.code) && this.selectedNoteId) {
        const editingNote = this.innerMelody.find(note => note.id === this.selectedNoteId)
        if ('ArrowUp' === $event.code) {
          const newPitch = this.getHighterNote(editingNote.pitch)
          if (newPitch) {
            editingNote.pitch = newPitch
          }
        } else if ('ArrowDown' === $event.code) {
          const newPitch = this.getLowerNote(editingNote.pitch)
          if (newPitch) {
            editingNote.pitch = newPitch
          }
        } else if ('ArrowRight' === $event.code) {
          editingNote.duration = this.getNextDuration(editingNote.duration)
        } else if ('ArrowLeft' === $event.code) {
          editingNote.duration = this.getPrevDuration(editingNote.duration)
        }
        this.$store.commit('SET_MELODY', this.innerMelody)
      }
    },
    getPrevDuration(duration) {
      if (this.durationData[0].code !== duration) {
        const index = this.durationData.findIndex((btn) => btn.code === duration)
        return this.durationData[index - 1].code
      } else {
        return this.durationData[this.durationData.length - 1].code
      }
    },
    getNextDuration(duration) {
      if (this.durationData[this.durationData.length - 1].code !== duration) {
        const index = this.durationData.findIndex((btn) => btn.code === duration)
        return this.durationData[index + 1].code
      } else {
        return this.durationData[0].code
      }
    },
    getHighterNote(pitch) {
      if (![-1, this.notePitches.length - 1].includes(this.notePitches.indexOf(pitch))) {
        return this.notePitches[this.notePitches.indexOf(pitch) + 1]
      }
    },
    getLowerNote(pitch) {
      if (![-1, 0].includes(this.notePitches.indexOf(pitch))) {
        return this.notePitches[this.notePitches.indexOf(pitch) - 1]
      }
    },
    onClick(note) {
      this.selectedNoteId = note.id
    },
    onEditorBlur() {
      this.selectedNoteId = ''
    }
  }
}
</script>

<style>

</style>
